{
  "internet_security_tips": {
    "password_security": {
      "tip_1": "Use strong passwords with a mix of uppercase, lowercase, numbers, and special characters.",
      "tip_2": "Enable two-factor authentication (2FA) for added security.",
      "tip_3": "Avoid reusing passwords across multiple accounts.",
      "tip_4": "Use a password manager to generate and store secure passwords.",
      "tip_5": "Change your passwords periodically and avoid using easily guessable passwords."
    },
    "safe_browsing": {
      "tip_1": "Only browse secure websites (look for https:// in the URL).",
      "tip_2": "Avoid clicking on suspicious links or pop-ups.",
      "tip_3": "Use a secure and updated browser.",
      "tip_4": "Enable browser extensions that block ads and trackers.",
      "tip_5": "Clear your browser cache and cookies regularly."
    },
    "email_safety": {
      "tip_1": "Beware of phishing emails. Do not click on suspicious links or attachments.",
      "tip_2": "Verify the sender’s email address before responding.",
      "tip_3": "Report spam emails immediately.",
      "tip_4": "Avoid sharing sensitive information over email unless it’s encrypted.",
      "tip_5": "Use a spam filter to block unwanted and malicious emails."
    },
    "device_security": {
      "tip_1": "Keep your device's operating system and software up to date.",
      "tip_2": "Install a reputable antivirus and firewall.",
      "tip_3": "Avoid connecting to unknown USB drives.",
      "tip_4": "Set up a lock screen with a PIN, pattern, or biometric authentication.",
      "tip_5": "Enable device encryption to protect stored data."
    },
    "social_media_safety": {
      "tip_1": "Avoid oversharing personal information.",
      "tip_2": "Restrict who can view your profile and posts by using privacy settings.",
      "tip_3": "Be cautious of friend requests from strangers.",
      "tip_4": "Do not click on unknown links or download files from messages.",
      "tip_5": "Review and limit app permissions connected to your social media accounts."
    },
    "secure_online_transactions": {
      "tip_1": "Use secure payment gateways and avoid saving card details on random websites.",
      "tip_2": "Never share OTPs, PINs, or passwords with anyone.",
      "tip_3": "Enable transaction notifications for your bank accounts.",
      "tip_4": "Ensure that the payment page URL starts with https:// and has a padlock icon.",
      "tip_5": "Avoid using public Wi-Fi for online transactions."
    },
    "public_wifi_usage": {
      "tip_1": "Avoid accessing sensitive accounts over public Wi-Fi.",
      "tip_2": "Use a Virtual Private Network (VPN) to encrypt your data.",
      "tip_3": "Disable automatic Wi-Fi connections to open networks.",
      "tip_4": "Avoid sharing personal information or making transactions on public networks.",
      "tip_5": "Use your mobile data as a hotspot when security is crucial."
    },
    "data_backup": {
      "tip_1": "Regularly back up important files to secure cloud storage or external drives.",
      "tip_2": "Use automatic backup tools for convenience.",
      "tip_3": "Keep multiple copies of critical data in different locations.",
      "tip_4": "Encrypt sensitive data before storing it in the cloud.",
      "tip_5": "Test your backups periodically to ensure data integrity."
    },
    "awareness_of_cyber_threats": {
      "tip_1": "Learn about common cyber threats like phishing, ransomware, and scams.",
      "tip_2": "Stay updated with the latest security news and trends.",
      "tip_3": "Participate in basic cybersecurity awareness training.",
      "tip_4": "Be cautious of online offers that seem too good to be true.",
      "tip_5": "Educate others in your circle about staying safe online."
    },
    "privacy_protection": {
      "tip_1": "Use privacy-focused browsers and search engines like DuckDuckGo.",
      "tip_2": "Manage and limit app permissions on your devices.",
      "tip_3": "Turn off location services for apps that don’t need it.",
      "tip_4": "Regularly review privacy policies of the services you use.",
      "tip_5": "Avoid sharing personal information on unknown websites or apps."
    }
  }
}
